import React, { useState } from 'react';
import Modal from 'react-bootstrap/Modal';
import Button from 'react-bootstrap/Button';

export default function Footer() {
    const [show, setShow] = useState(false);
    const handleShow = () => setShow(true);
    const handleClose = () => setShow(false);

    return (
        <footer className='fixed-bottom bg-white text-center text-body d-inline-flex justify-content-center align-items-center small'>

            <Button variant='link' size='sm' onClick={handleShow}>תנאים והגבלות</Button>|
            <div className=' me-2'>תכנון ובניית אתר: <a href='https://www.linkedin.com/in/yossef-horvitz-511786278/'>Yossef Horvitz</a></div>

            <Modal show={show} onHide={handleClose} size="lg">
                <Modal.Header closeButton>
                </Modal.Header>
                <Modal.Body className=' text-black'>
                    <h6>1. הסכמה לתנאים</h6>
                    <p>שימוש באתר זה מהווה הסכמה מלאה לתנאים ולהגבלות המפורטים להלן. אם אינך מסכים לתנאים אלה, אנא אל תשתמש באתר.</p>
                    <h6>2. שימוש באתר</h6>
                    <p>האתר מיועד לשימוש אישי ולא מסחרי בלבד. השימוש בתוכן האתר ובשירותים המוצעים בו נעשה על אחריות המשתמש בלבד. אסור להשתמש באתר למטרות שאינן חוקיות או אסור אחרות.</p>
                    <h6>3. הגבלת אחריות</h6>
                    <p>אנו עושים כל מאמץ להבטיח שהמידע באתר יהיה נכון ומדויק, אך איננו יכולים להבטיח את נכונותו או שלמותו בכל זמן נתון. האתר מספק מידע כללי בלבד ואינו מהווה ייעוץ מקצועי או רפואי. השימוש במידע הניתן באתר זה הוא על אחריות המשתמש בלבד. אנו לא נושאים באחריות לכל נזק ישיר, עקיף, מיוחד או תוצאתי שייגרם כתוצאה מהשימוש באתר או מהמידע המוצג בו.</p>
                    <h6>4. תוכן האתר</h6>
                    <p>התוכן באתר, כולל אך לא מוגבל לטקסטים, תמונות, גרפיקה ואלמנטים עיצוביים, הוא רכושנו או רכושם של צדדים שלישיים בעלי זכויות יוצרים. השימוש בתוכן זה מותר רק לצורך אישי ולא מסחרי. כל העתקה, שכפול, הפצה או העברה של התוכן ללא אישור מראש ובכתב היא אסורה.</p>
                    <h6>5. קישורים לאתרים חיצוניים</h6>
                    <p>האתר עשוי להכיל קישורים לאתרים חיצוניים שאינם בשליטתנו. איננו אחראים לתוכן או למדיניות הפרטיות של אתרים אלה. כל גישה לאתרים חיצוניים נעשית על אחריות המשתמש בלבד.</p>
                    <h6>6. שינויים בתנאים</h6>
                    <p>אנו שומרים את הזכות לשנות את תנאים וההגבלות המפורטים כאן בכל עת וללא הודעה מוקדמת. השינויים ייכנסו לתוקף עם פרסומם באתר. השימוש המתמשך באתר לאחר ביצוע השינויים מהווה הסכמה לתנאים החדשים.</p>
                    <h6>7. הפסקת שימוש</h6>
                    <p>אנו שומרים את הזכות להפסיק את הגישה שלך לאתר בכל עת וללא הודעה מוקדמת אם יימצא שאתה מפר את התנאים וההגבלות הללו.</p>
                    <h6>8. חוקי מדינת ישראל</h6>
                    <p>תנאים וההגבלות המפורטים כאן כפופים לחוקי מדינת ישראל. כל מחלוקת הנוגעת לשימוש באתר או לתנאים וההגבלות תידון אך ורק בבתי המשפט המוסמכים בתל אביב יפו.</p>
                    <h6>9. יצירת קשר</h6>
                    <p>לפרטים נוספים או שאלות לגבי תנאים וההגבלות, ניתן לפנות אלינו בכתובת <a href='mailto:yossefhorvitz@gmail.com'>yossefhorvitz@gmail.com</a>.</p>
                    <p>תנאים אלה נכתבו בתאריך 18/09/2024.</p>
                </Modal.Body>
                <Modal.Footer>
                    <Button variant="secondary" onClick={handleClose}>סגור</Button>
                </Modal.Footer>
            </Modal>
        </footer>
    )
}
