import React from 'react';

const Info = () => {
    return (
        <div className="container mt-5">
            <h1 className=' mt-5 mb-4 text-purple text-center'>מידע כללי</h1>
            <h2 className="text-blue">מהו תו נכה לרכב?</h2>
            <p>תו נכה לרכב הוא אישור רשמי המונפק על ידי משרד התחבורה בישראל, המעניק זכויות וסיוע לאנשים עם מוגבלויות בתחום התחבורה והניידות. תו זה מאפשר לבעליו להשתמש בחניות ייעודיות לנכים ולקבל הקלות משמעותיות בחניה במקומות ציבוריים. מטרתו העיקרית היא להקל על ההתניידות של אנשים עם מוגבלות תנועתית ולאפשר להם גישה נוחה ובטוחה יותר לשירותים, מבנים ציבוריים ומקומות תעסוקה.</p>

            <h2 className="text-blue">זכאות לתו נכה לרכב</h2>
            <p>הזכאות לתו נכה נקבעת על פי קריטריונים מוגדרים בחוק חניה לנכים, התשנ"ד-1993. להלן הקבוצות העיקריות הזכאיות לתו נכה:</p>
            <ul>
                <li>אנשים עם מוגבלות פיזית חמורה המגבילה את ניידותם באופן משמעותי.</li>
                <li>אנשים הסובלים מבעיות לבביות חמורות.</li>
                <li>אנשים עם מוגבלות קשה אחרת המוכרת על ידי הוועדה הרפואית של משרד התחבורה.</li>
                <li>מטפלים קבועים באנשים עם מוגבלויות חמורות, הזקוקים לרכב לצורך הסיוע.</li>
            </ul>

            <h2 className="text-blue">תהליך הגשת בקשה לתו נכה</h2>
            <ol>
                <li><strong>איסוף מסמכים:</strong> יש לאסוף את כל המסמכים הרפואיים הרלוונטיים המעידים על המוגבלות.</li>
                <li><strong>מילוי טופס בקשה:</strong> ניתן להגיש בקשה <a href='https://www.gov.il/he/service/disability_parking_badge' target='blanc'>כאן</a> באמצעות טופס מקוון ישירות באתר או באמצעות הדואר.</li>
                <li><strong>הגשת הבקשה:</strong> יש להגיש את הטופס המלא בצירוף כל המסמכים הנדרשים.</li>
                <li><strong>בדיקת הבקשה:</strong> הבקשה נבדקת על ידי ועדה רפואית של משרד התחבורה.</li>
                <li><strong>קבלת החלטה:</strong> הוועדה הרפואית מקבלת החלטה לגבי מתן תג הנכה. במקרים של דחייה, ניתן להגיש ערעור.</li>
            </ol>

            <h2 className="text-blue">יתרונות של תו נכה</h2>
            <ul>
                <li><strong>גישה לחניות ייעודיות:</strong> אפשרות להחנות בחניות נכים מסומנות הממוקמות בקרבת כניסות למבנים ושירותים ציבוריים.</li>
                <li><strong>פטור מתשלום:</strong> בעלי תג נכה זכאים לפטור מתשלום חניה במקומות ציבוריים רבים, כולל חניונים עירוניים ומסחריים.</li>
                <li><strong>חניה במקומות מוגבלים:</strong> אפשרות לחנות במקומות בהם החניה מוגבלת בזמן או אסורה לרכבים רגילים, בכפוף לתנאים מסוימים.</li>
                <li><strong>הקלות בתחבורה ציבורית:</strong> במקרים מסוימים, בעלי תו נכה יכולים ליהנות מהקלות בשימוש בתחבורה ציבורית, כגון נסיעה בנתיבי תחבורה ציבורית.</li>
                <li><strong>ניידות ועצמאות מוגברת:</strong> התו מאפשר לבעליו להגיע למקומות עבודה, מוסדות חינוך ומרכזי קניות באופן עצמאי יותר.</li>
            </ul>

            <h2 className="text-blue">שימוש נכון ואחראי בתו נכה</h2>
            <p>חשוב להקפיד על שימוש נכון ואחראי בתו הנכה:</p>
            <ul>
                <li>יש להציג את התו במקום ברור ונראה ברכב בעת החניה.</li>
                <li>התו הוא אישי ואינו ניתן להעברה. אסור להשתמש בו כאשר הנכה אינו ברכב.</li>
                <li>יש לכבד את החוקים והתקנות הנוגעים לשימוש בתו הנכה.</li>
                <li>במקרה של שינוי במצב הרפואי או בנסיבות המזכות בתו, יש לדווח למשרד התחבורה.</li>
            </ul>
        </div>
    );
};

export default Info;
